name: "rtmpose_preprocess"
backend: "python"
max_batch_size: 1
input [
{
    name: "origin_img"
    data_type: TYPE_UINT8
    dims: [-1, -1, -1 ]
}
]

output [
{
    name: "rtmpose_infer_input"
    data_type: TYPE_FP32
    dims: [1, 3, 384, 288 ]
},
{
    name: "input_center"
    data_type: TYPE_FP32
    dims: [1, 2]
},
{
    name: "input_scale"
    data_type: TYPE_FP32
    dims: [1, 2]
}
]