name: "yolo_preprocess"
backend: "python"
max_batch_size: 1
input [
{
    name: "origin_img"
    data_type: TYPE_UINT8
    dims: [-1, -1, -1 ]
}
]

output [
{
    name: "yolo_infer_input"
    data_type: TYPE_FP32
    dims: [1, 3, 640, 640 ]
},
{
    name: "origin_img_shape"
    data_type: TYPE_INT32,
    dims: [-1, 4]
}
]